Revit 2027 API
FamilyInstanceCreationData(Object) Constructor
Initializes a new instance of the FamilyInstanceCreationData class
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FamilyInstanceCreationData(
	Object proxy
)
Public Sub New (
	proxy As Object
)
public:
FamilyInstanceCreationData(
	Object^ proxy
)
new :
        proxy : Object -> FamilyInstanceCreationData
Parameters
proxy Object
See Also
Reference
FamilyInstanceCreationData Class
FamilyInstanceCreationData Overload
Autodesk.Revit.Creation Namespace